# Practical Data Analytics with Jupyter Notebooks -- Book
### This is another weekend project in the times of COVID-19, might as well be productive

#### Most of the intro is pretty basic. I have run through the pandas example to review data types

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/evolution_of_data_analysis.csv', header=0, sep="|")
df.head(2)

,Year,Decade,Milestone Title,Milestone Event,Why Important,Reference,People Process or Technology Tag
0,1945,1940s,ENIAC,First electronic general-purpose computer = ENIAC,Faster decisions using a computer and mathmatics,https://en.wikipedia.org/wiki/ENIAC,Technology
1,1945,1940s,John von Neumann / array,John von Neumann creates a merge sort algorith...,Arrays allow mathmatics| grouping and sorting ...,https://en.wikipedia.org/wiki/John_von_Neumann,People

In [3]:
df.groupby(['Decade']).agg({'Year':'count'})

        Year
Decade
1940s      2
1950s      2
1960s      1
1970s      2
1980s      5
1990s      9
2000s     14
2010s      7

In [7]:
import sqlite3

In [8]:
conn = sqlite3.connect('./data/customer_sales.db')

In [9]:
df_customers = pd.read_sql_query("SELECT * from tbl_customers;",conn)
df_customers.head()

,Customer_ID,First_Name,Last_Name,Address_Line_1,Address_Line_2,City,State,ZipCode,Phone,Email
0,1,Johnny,Smith,123 Main Street,None,Miami,FL,12345,302-555-1212,jsmith@email.com
1,2,Debbie,Winner,31 Roundtree Lane,None,Dover,NJ,18888,None,debbie_winner@email.com
2,3,Seth,Winer,310 Roundtree Lane,None,Dover,NJ,18888,None,sw@email.com
3,4,Anthony,Leedessa,Dallas Drive,Unit 806,El Paso,TX,99928,None,alligator@email.com
4,5,Pete,Einstein,Morton Street,None,Philadelphia,PA,28373,215-555-1212,peter_einstein@email.com

In [10]:
pd.isnull(df_customers)

,Customer_ID,First_Name,Last_Name,Address_Line_1,Address_Line_2,City,State,ZipCode,Phone,Email
0,False,False,False,False,True,False,False,False,False,False
1,False,False,False,False,True,False,False,False,True,False
2,False,False,False,False,True,False,False,False,True,False
3,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,True,False,False,False,False,False